In [7]:
import pandas as pd
import numpy as np

# pandas Data Strucutres

## Series
A Series is a one-dimentional array-like object, including a sequence of value (similar to NumPy array) and an associated array of *index*.

In [8]:
obj=pd.Series([4,5,-3,2])
obj
#this Series contains two part, value as numpy array([4,5,-3,2]) and index. Default index is the integer array from 0 to N-1, where N is the length of the Series.

0    4
1    5
2   -3
3    2
dtype: int64

In [9]:
obj.values

array([ 4,  5, -3,  2])

In [10]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [11]:
#Specify a different index
obj2=pd.Series([4,5,-3,2],index=['d','c','a','b'])
obj2

d    4
c    5
a   -3
b    2
dtype: int64

In [12]:
obj2.index #object is a Python object type

Index(['d', 'c', 'a', 'b'], dtype='object')

In [13]:
#pandas has more fexibility to use index than NumPy. 
obj2['c']

5

In [14]:
obj2[1]

5

In [15]:
obj2[['a','d']]
#['a','d'] can be seen as a list of indices. It returns to a subset of the original Seires, which is also a Seiries.

a   -3
d    4
dtype: int64

### NumPy_like operations

In [16]:
obj2[obj2>0]

d    4
c    5
b    2
dtype: int64

In [17]:
np.exp(obj2)

d     54.598150
c    148.413159
a      0.049787
b      7.389056
dtype: float64

In [18]:
obj2

d    4
c    5
a   -3
b    2
dtype: int64

### Create a Series from Dict

### <font color='red'>**Exercise**</font>

Can you create a Series from a Dictionary where {'ham':100,'egg':200}?

Note the index in the resulting Series will have the dict's keys in sorted order.

In [19]:
food = {'ham':100,'egg':200}
obj3 = pd.Series(food) #pd.series(food,index=food.key)
obj3

ham    100
egg    200
dtype: int64

In [20]:
#We can override the Series by passing new dict keys in order. No value for
# bread, it appears as NaN meaning not a number. 
#Since 'egg' is not in new index list, it is excluded from the Seires. 
new=['bread','ham']
obj4=pd.Series(food,index=new)
obj4

bread      NaN
ham      100.0
dtype: float64

### missing data: 'missing' or 'NA'

In [21]:
pd.isnull(obj4)
#obj3.isnull()

bread     True
ham      False
dtype: bool

In [22]:
pd.notnull(obj4)

bread    False
ham       True
dtype: bool

In [23]:
obj4['bread']=300
obj4

bread    300.0
ham      100.0
dtype: float64

In [24]:
print(obj3)
print(obj4)
obj4+obj3

ham    100
egg    200
dtype: int64
bread    300.0
ham      100.0
dtype: float64

bread      NaN
egg        NaN
ham      200.0
dtype: float64

## DataFrame

There are many possible data inputs to DataFrame. Such as, np array, dict of lists ot tuples, dict of Series, dict of dicts and so on...

We only intorudce how to contruct DataFrame through dict of lists.

In [25]:
#create a DataFrame through a dict of equal length lists or NumPy arrays:
data={'state':['Ohio','Ohio','Ohio','Nevada','Nevada','Nevada'],
     'year':[2000,2001,2002,2000,2001,2002],
     'pop':[1.5,1.7,3.6,2.4,2.9,3.2]}
frame=pd.DataFrame(data)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2000  2.4
4  Nevada  2001  2.9
5  Nevada  2002  3.2

In [26]:
frame.head()#this method selects only the first 5 rows.

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2000  2.4
4  Nevada  2001  2.9

In [27]:
frame=pd.DataFrame(data,index=[1,2,3,4,5,6])
frame

    state  year  pop
1    Ohio  2000  1.5
2    Ohio  2001  1.7
3    Ohio  2002  3.6
4  Nevada  2000  2.4
5  Nevada  2001  2.9
6  Nevada  2002  3.2

In [28]:
frame2=pd.DataFrame(data,index=range(1,7),columns=['year','state','pop','debt'])#columns are arranged in order
frame2

   year   state  pop debt
1  2000    Ohio  1.5  NaN
2  2001    Ohio  1.7  NaN
3  2002    Ohio  3.6  NaN
4  2000  Nevada  2.4  NaN
5  2001  Nevada  2.9  NaN
6  2002  Nevada  3.2  NaN

In [29]:
frame2.year #notice the index has been overidden.
#frame2['year']

1    2000
2    2001
3    2002
4    2000
5    2001
6    2002
Name: year, dtype: int64

In [30]:
frame2.state

1      Ohio
2      Ohio
3      Ohio
4    Nevada
5    Nevada
6    Nevada
Name: state, dtype: object

In [32]:
frame2.loc[6] #Retrive a specific row

year       2002
state    Nevada
pop         3.2
debt        NaN
Name: 6, dtype: object

In [33]:
frame2.loc[2]

year     2001
state    Ohio
pop       1.7
debt      NaN
Name: 2, dtype: object

In [34]:
frame2['debt']=16.5
frame2

   year   state  pop  debt
1  2000    Ohio  1.5  16.5
2  2001    Ohio  1.7  16.5
3  2002    Ohio  3.6  16.5
4  2000  Nevada  2.4  16.5
5  2001  Nevada  2.9  16.5
6  2002  Nevada  3.2  16.5

In [35]:
np.arange(1.0,7.0,1.0)

array([1., 2., 3., 4., 5., 6.])

In [36]:
#how did we asign float number 1.0-6.0 to the debt. 
frame2['debt']=np.arange(1.0,7.0,1.0)
frame2

   year   state  pop  debt
1  2000    Ohio  1.5   1.0
2  2001    Ohio  1.7   2.0
3  2002    Ohio  3.6   3.0
4  2000  Nevada  2.4   4.0
5  2001  Nevada  2.9   5.0
6  2002  Nevada  3.2   6.0

In [37]:
#if you assign Series to column in DataFrame. The labels will be realigned exactly to the DataFrame's index, inserting missing values to the rest.
val=pd.Series([-1.2,-1.5,-1.7],index=[2,4,5])
val

2   -1.2
4   -1.5
5   -1.7
dtype: float64

In [38]:
frame2['debt']=val
frame2

   year   state  pop  debt
1  2000    Ohio  1.5   NaN
2  2001    Ohio  1.7  -1.2
3  2002    Ohio  3.6   NaN
4  2000  Nevada  2.4  -1.5
5  2001  Nevada  2.9  -1.7
6  2002  Nevada  3.2   NaN

In [39]:
frame2.state=='Ohio'

1     True
2     True
3     True
4    False
5    False
6    False
Name: state, dtype: bool

In [40]:
#add a new column. Similar to the operation on Dict.
frame2['eastern']= frame2.state=='Ohio'
frame2

   year   state  pop  debt  eastern
1  2000    Ohio  1.5   NaN     True
2  2001    Ohio  1.7  -1.2     True
3  2002    Ohio  3.6   NaN     True
4  2000  Nevada  2.4  -1.5    False
5  2001  Nevada  2.9  -1.7    False
6  2002  Nevada  3.2   NaN    False

In [41]:
del frame2['eastern']
frame2.columns
#frame2.drop(columns=['eastern']) #drop does not make any changes to original frame

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [42]:
frame2

   year   state  pop  debt
1  2000    Ohio  1.5   NaN
2  2001    Ohio  1.7  -1.2
3  2002    Ohio  3.6   NaN
4  2000  Nevada  2.4  -1.5
5  2001  Nevada  2.9  -1.7
6  2002  Nevada  3.2   NaN

In [43]:
frame2.T # Transpose DataFrame. note that "eastern" has been deleted

          1     2     3       4       5       6
year   2000  2001  2002    2000    2001    2002
state  Ohio  Ohio  Ohio  Nevada  Nevada  Nevada
pop     1.5   1.7   3.6     2.4     2.9     3.2
debt    NaN  -1.2   NaN    -1.5    -1.7     NaN

In [44]:
frame2.values
#values attribute returns the data contained in the DataFrame as a two-dimentional np array.

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, -1.2],
       [2002, 'Ohio', 3.6, nan],
       [2000, 'Nevada', 2.4, -1.5],
       [2001, 'Nevada', 2.9, -1.7],
       [2002, 'Nevada', 3.2, nan]], dtype=object)

## Index Objects
Index Objects in pandas are different with the regular index in array we talk about. 

Any array or other sequence of labels when cosntructing a Series or DataFrame in internally convered to an Index.

In [45]:
import pandas as pd
labels=pd.Index(['foo','foo',1,2,3,4,7])

In [46]:
labels[1]

'foo'

In [47]:
labels[1]='boo'#It is immutable.

TypeError: Index does not support mutable operations

### <font color='red'> Exercise</font>

Which one is mutable, tuple or list?

In [48]:
frame

    state  year  pop
1    Ohio  2000  1.5
2    Ohio  2001  1.7
3    Ohio  2002  3.6
4  Nevada  2000  2.4
5  Nevada  2001  2.9
6  Nevada  2002  3.2

In [49]:
pd.DataFrame(frame,index=labels)
# a pandas Index can contain duplicate lables.

      state    year  pop
foo     NaN     NaN  NaN
foo     NaN     NaN  NaN
1      Ohio  2000.0  1.5
2      Ohio  2001.0  1.7
3      Ohio  2002.0  3.6
4    Nevada  2000.0  2.4
7       NaN     NaN  NaN

# Essential Functionality

## 1. Reindexing
Calling reindex on the Seires or DataFrame rearranges the data according to the new index, introducing missing values if any index values were not aleady presnet.

In [50]:
#create a Seires and then apply reindex. 
import pandas as pd
obj=pd.Series([4.5,.3,-2],index=['a','c','d'])
obj

a    4.5
c    0.3
d   -2.0
dtype: float64

In [51]:
#calling reindex
obj2=obj.reindex(['a','b','c','d'])
obj2

a    4.5
b    NaN
c    0.3
d   -2.0
dtype: float64

In [52]:
#for time sires data, we can fill values when reindex when some data are missing.
#ffill means forward filling. 
obj3=obj.reindex(['a','b','c','d','e'],method='ffill')
obj3

a    4.5
b    4.5
c    0.3
d   -2.0
e   -2.0
dtype: float64

In [53]:
#create a DataFrame and then apply reindex for both index and columns. 
frame=pd.DataFrame(np.arange(9).reshape(3,3),index=['a','b','c'],columns=['Ohio','Texas','California'])
frame

   Ohio  Texas  California
a     0      1           2
b     3      4           5
c     6      7           8

In [55]:
frame2=frame.reindex(['a','b','c','d'])
frame2

# Question: Will frame.reindex rewrite frame too?

   Ohio  Texas  California
a     0      1           2
b     3      4           5
c     6      7           8

In [56]:
frame.reindex(['a','b','c','d'])
frame

   Ohio  Texas  California
a     0      1           2
b     3      4           5
c     6      7           8

In [73]:
frame2.loc['d']=[9.0,10.0,11.0]
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   3.0    4.0         5.0
c   6.0    7.0         8.0
d   9.0   10.0        11.0

### <font color='red'> Exercise:</font>

In frame2,can you replace the columns by ['SF','NYC','Chichago'] ?

In [74]:
frame2 = frame2.reindex(columns=['SF','NYC','Chichago'])
frame2

   SF  NYC  Chichago
a NaN  NaN       NaN
b NaN  NaN       NaN
c NaN  NaN       NaN
d NaN  NaN       NaN

## 2. Dropping Entries from an Axis

The _drop_ method will return a new object with the indicated value deleted from an axis.

In [75]:
#Create a Series and apply drop
obj=pd.Series(np.arange(5),index=['a','b','c','d','e'])
print(obj)
obj.drop('c')

# Note: obj has not been re-written.

a    0
b    1
c    2
d    3
e    4
dtype: int64

a    0
b    1
d    3
e    4
dtype: int64

In [76]:
obj

a    0
b    1
c    2
d    3
e    4
dtype: int64

In [77]:
# If you want to modify the current object, use inplace
# Be careful to use this, because this will distroy data. 
obj.drop('c',inplace=True)
obj

a    0
b    1
d    3
e    4
dtype: int64

In [78]:
np.arange(16).reshape(4,4)

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [12, 13, 14, 15]])

In [58]:
# Create a DataFrame and apply drop().
frame=pd.DataFrame(np.arange(16).reshape(4,4),index=['A','B','C','D'],columns=['one','two','three','four'])
frame

   one  two  three  four
A    0    1      2     3
B    4    5      6     7
C    8    9     10    11
D   12   13     14    15

In [59]:
#Without specifying the axis, it will start from axis 0, or rows. 
frame.drop('A')

   one  two  three  four
B    4    5      6     7
C    8    9     10    11
D   12   13     14    15

In [60]:
frame.drop(['A','B'])

   one  two  three  four
C    8    9     10    11
D   12   13     14    15

In [61]:
#axis 1 is the column. 
frame.drop('one',axis = 1)

   two  three  four
A    1      2     3
B    5      6     7
C    9     10    11
D   13     14    15

## 3. Indexing and Selection

Series indexing works analogously to NumPy array indexing, excepting that you can use the Series' index value instead of only integers.

In [62]:
obj=pd.Series(np.arange(5),index=['a','b','c','d','e'])
obj

a    0
b    1
c    2
d    3
e    4
dtype: int64

### <font color='red'> Exercise </font>

How do you select the value of index 'c'?

In [63]:
obj['c']

2

Indexing into a DataFrame is for retrieving one or more columns either with a single value or sequence.

In [64]:
frame=pd.DataFrame(np.arange(16).reshape(4,4),index=['A','B','C','D'],columns=['one','two','three','four'])
frame

   one  two  three  four
A    0    1      2     3
B    4    5      6     7
C    8    9     10    11
D   12   13     14    15

In [65]:
# this syntax slices based on axis 0 or row. 
frame[:2]

   one  two  three  four
A    0    1      2     3
B    4    5      6     7

In [66]:
frame['two']

A     1
B     5
C     9
D    13
Name: two, dtype: int64

In [67]:
frame[['one','two']]#selecting more than 1 column use [[ ]]

   one  two
A    0    1
B    4    5
C    8    9
D   12   13

When you want to select a certain row, try loc and iloc.

In [68]:
import pandas as pd
import numpy as np
data=pd.DataFrame(np.arange(16).reshape(4,4),index=['Ohio','Colorado','Utah','New York'],
                 columns=['one','two','three','four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [69]:
data.loc['Colorado',['two','three']]

two      5
three    6
Name: Colorado, dtype: int64

In [70]:
# Silimar selection with index represented as integers 
data.iloc[1,[1,2]]# use index integers for slicing

two      5
three    6
Name: Colorado, dtype: int64

In [71]:
data.iloc[2] # Select the entire row of index 2.

one       8
two       9
three    10
four     11
Name: Utah, dtype: int64

In [72]:
data.iloc[:,:2][data.one>5.0]

          one  two
Utah        8    9
New York   12   13

### <font color='red'> **Exercise:**</font>

slice value greater than or equal to 8 for column "one " and "four"

In [104]:
data.iloc[:,[0,3]][(data.one>=8)&(data.four>=8)]

          one  four
Utah        8    11
New York   12    15

In [75]:
data.loc[:,['one','four']][(data.one>=8)&(data.four>=8)]

          one  four
Utah        8    11
New York   12    15

### <font color='red'> **Exercise:**</font>

select a single scalar value of row 'Ohio' and column 'one'.

In [76]:
data.loc['Ohio','one']
#data.iloc[0,0]

0

## 4. Arithmetic and Data Alignment

You can add same type of objects. We will try Seires and then DataFrame. 

When there is mismatch of labels, the internal data alignment introduces missing values in the label location that don't overlap. Missing values will then be passed in future arithmetic computations.

In [80]:
s1=pd.Series([1.2,3.4],index=['a','c'])
s1

a    1.2
c    3.4
dtype: float64

In [81]:
s2=pd.Series([-1.2,2.,-3.4,5.0],index=['a','b','c','d'])
s2

a   -1.2
b    2.0
c   -3.4
d    5.0
dtype: float64

In [82]:
s1+s2

a    0.0
b    NaN
c    0.0
d    NaN
dtype: float64

In [83]:
#list() convert an iterable (tuple, string, set, dictionary) to a list.

df1=pd.DataFrame(np.arange(6.).reshape(2,3),columns=list('bcd'),index=list('AB'))
df1

     b    c    d
A  0.0  1.0  2.0
B  3.0  4.0  5.0

In [85]:
df2=pd.DataFrame(np.arange(4.).reshape(2,2),
                 columns=list('ab'),index=list('AC'))
df2

     a    b
A  0.0  1.0
C  2.0  3.0

In [86]:
df1+df2

    a    b   c   d
A NaN  1.0 NaN NaN
B NaN  NaN NaN NaN
C NaN  NaN NaN NaN

**Arithmetic between DataFrame and Series**
matches the index of the Series on the DataFrame's **columns**, broadcasting down the rows.

In [87]:
df1

     b    c    d
A  0.0  1.0  2.0
B  3.0  4.0  5.0

In [88]:
#do you remember how to select row 0 from DataFrame?
S=df1.iloc[0]
S
#note: this Series contains the column name from the DataFrame

b    0.0
c    1.0
d    2.0
Name: A, dtype: float64

In [89]:
df1-S

     b    c    d
A  0.0  0.0  0.0
B  3.0  3.0  3.0

In [90]:
df1+S

     b    c    d
A  0.0  2.0  4.0
B  3.0  5.0  7.0

In [91]:
#What if we define a new pure Series. 
S2=pd.Series(range(4),index=list('bcde'))
S2

b    0
c    1
d    2
e    3
dtype: int64

In [92]:
df1+S2

     b    c    d   e
A  0.0  2.0  4.0 NaN
B  3.0  5.0  7.0 NaN

Numpy element-wise array methods also work with pandas objects.

In [93]:
frame=pd.DataFrame(np.random.randn(4,3),
                   columns=list('abc'),index=list('ABCD'))
frame

          a         b         c
A -0.102832 -0.736798 -0.176692
B  0.772156 -2.051224  0.599778
C -0.301691 -0.514478 -0.322134
D  0.702555  1.260525 -1.110101

In [94]:
np.abs(frame)

          a         b         c
A  0.102832  0.736798  0.176692
B  0.772156  2.051224  0.599778
C  0.301691  0.514478  0.322134
D  0.702555  1.260525  1.110101

## <font color='red'> The following is Self-study material.</font>

## 5. Sorting and Ranking
The data is sorted by rows or columns in lexicographically asceding order by default. We apply sort_index method in both Series and DataFrame.

In [110]:
S=pd.Series(range(4),index=list('cdba'))
S

c    0
d    1
b    2
a    3
dtype: int64

In [111]:
S.sort_values()

c    0
d    1
b    2
a    3
dtype: int64

In [112]:
S.sort_index()

a    3
b    2
c    0
d    1
dtype: int64

In [113]:
frame=pd.DataFrame(np.arange(8).reshape(2,4),index=['B','A'],columns=list('badc'))
frame

   b  a  d  c
B  0  1  2  3
A  4  5  6  7

In [114]:
frame.sort_index()#sort rows

   b  a  d  c
A  4  5  6  7
B  0  1  2  3

In [115]:
frame.sort_index(axis=1)#sort columns

   a  b  c  d
B  1  0  3  2
A  5  4  7  6

In [116]:
#sort the index in descending order. 
frame.sort_index(axis=1,ascending=False)

   d  c  b  a
B  2  3  0  1
A  6  7  4  5

In [117]:
# To sort a Series by its values. 
# Any missing value will be sorted to the end of the Series by default. 
S.sort_values(ascending=False)

a    3
b    2
d    1
c    0
dtype: int64

In [124]:
# To sort a DataFrame by its values. 
# Pass one or more column names to by option of sort_values. We sort in revser order. 
frame.sort_values(by=['a','d'],ascending = False)

   b  a  d  c
A  4  5  6  7
B  0  1  2  3

### Ranking
Ranking assigns ranks from 1 through the number of valide data points in an array. 
For example, a list [3,1.5, 3] can be sorted to ascending order first - [1.5, 3, 3]. 1.5 is at rank 1,two 3s are at rank 2 and 3. 
Those two 3s are called a tied group. 
By default, each 3 will have a mean rank 2.5.

In [128]:
S=pd.Series([7,-5,7,4,7])
print(S)
S.rank()

0    7
1   -5
2    7
3    4
4    7
dtype: int64

0    4.0
1    1.0
2    4.0
3    2.0
4    4.0
dtype: float64

Ranks can also be assigned to the order in which they are observed in the data. 
Take [1.5, 3,3] for example again. the first 3 will take rank 2, and the second 3 will take rank 3.

In [129]:
S.rank(method='first')

0    3.0
1    1.0
2    4.0
3    2.0
4    5.0
dtype: float64

**More tie-breaking method with rank**

'avaerage': default one

'min': Use the minimum rank for the whole group

'max': Use the maximum rank for the whole group

'first':Assign ranks in the order the values appear in the data

In [130]:
print(S.rank(method='min'))
print(S.rank(method='max'))

0    3.0
1    1.0
2    3.0
3    2.0
4    3.0
dtype: float64
0    5.0
1    1.0
2    5.0
3    2.0
4    5.0
dtype: float64

In [131]:
D=pd.DataFrame(np.arange(4).reshape(2,2),
               index=list('ab'), columns=list('CD'))
print(D)
D.loc['d']=[3,3]
print(D)

   C  D
a  0  1
b  2  3
   C  D
a  0  1
b  2  3
d  3  3

In [49]:
#rank based on the column, or rank across the row
D.rank(axis=0, method='first',ascending=False)

     C    D
a  3.0  3.0
b  2.0  1.0
d  1.0  2.0